#05 Membalikan Urutan baris dan kolom pada Data Frame

import Modules

import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

Persiapkan Data Frame

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('abcde')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=cols)
df

   a  b  c  d  e
0  1  7  5  9  7
1  6  9  4  3  7
2  9  4  4  3  5
3  9  7  7  1  2
4  2  5  6  2  2

Membalikan Urutan Kolumn

In [7]:
df.loc[:,::-1]

   e  d  c  b  a
0  7  9  5  7  1
1  7  3  4  9  6
2  5  3  4  4  9
3  2  1  7  7  9
4  2  2  6  5  2

Membalikan Urutan Baris

In [8]:
df.loc[::-1]

   a  b  c  d  e
4  2  5  6  2  2
3  9  7  7  1  2
2  9  4  4  3  5
1  6  9  4  3  7
0  1  7  5  9  7

Membalikan Urutan Baris dan menyesuaikan  ulang Index

In [10]:
df.loc[::-1].reset_index(drop=True)

   a  b  c  d  e
0  2  5  6  2  2
1  9  7  7  1  2
2  9  4  4  3  5
3  6  9  4  3  7
4  1  7  5  9  7

#6 : Mengganti nama(label)kolom pada Data Frame

Import Modules

In [11]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [12]:
n_rows = 5
n_cols = 5
cols = tuple('abcde')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=cols)
df

   a  b  c  d  e
0  7  4  9  6  3
1  1  4  7  2  1
2  9  5  2  7  9
3  7  7  2  2  7
4  3  3  1  2  9

Mengganti Nama(label)untuk sebuah kolom pada Data Frame

In [16]:
df.rename(columns={'c':'Hobi'})

   a  b  Hobi  d  e
0  7  4     9  6  3
1  1  4     7  2  1
2  9  5     2  7  9
3  7  7     2  2  7
4  3  3     1  2  9

Mengganti Nama(label)untuk banyak sebuah kolom pada Data Frame

In [18]:
df.rename(columns={'a':'Nama','c':'Hobi','d':'Kota'})

   Nama  b  Hobi  Kota  e
0     7  4     9     6  3
1     1  4     7     2  1
2     9  5     2     7  9
3     7  7     2     2  7
4     3  3     1     2  9

# 07 Menghapus(drop)missing value(NaN)

In [19]:
import pandas as pd
print(pd.__version__)

1.3.4

Persiapkan Data Frame

In [33]:
df= pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  JYF6Fzc8cp -0.903299  0.236366 -0.468730  1.448436
1  ghsb1QprnL -0.244421  0.301756  0.246591  0.011883
2  0DH9VSDHHC -1.204583 -0.590780       NaN -0.065244
3  fg3rvEyyPF -0.085188  1.612383  0.788887 -1.013376
4  wx2emDfsxN  0.792515  0.258211 -0.331126  0.160950

In [34]:
df =df.rename(columns={'index':'z'})
df.head()

            z         A         B         C         D
0  JYF6Fzc8cp -0.903299  0.236366 -0.468730  1.448436
1  ghsb1QprnL -0.244421  0.301756  0.246591  0.011883
2  0DH9VSDHHC -1.204583 -0.590780       NaN -0.065244
3  fg3rvEyyPF -0.085188  1.612383  0.788887 -1.013376
4  wx2emDfsxN  0.792515  0.258211 -0.331126  0.160950

In [35]:
df_backup = df.copy(deep=True)

Menghapus(Drop) Setiap Kolom yang mengandung missing values

In [36]:
df= df.dropna(axis='columns')
df.head()

            z
0  JYF6Fzc8cp
1  ghsb1QprnL
2  0DH9VSDHHC
3  fg3rvEyyPF
4  wx2emDfsxN

menghapus(drop )setiap baris yang mengandung missing values

In [37]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            z         A         B         C         D
0  JYF6Fzc8cp -0.903299  0.236366 -0.468730  1.448436
1  ghsb1QprnL -0.244421  0.301756  0.246591  0.011883
3  fg3rvEyyPF -0.085188  1.612383  0.788887 -1.013376
4  wx2emDfsxN  0.792515  0.258211 -0.331126  0.160950
5  UNYavIM4QY  0.134966  0.574914  0.700254  0.596546

Persentase Missing value untuk setiap kolom

In [38]:
df = df_backup.copy(deep=True)
df.isna().mean()

z    0.000000
A    0.100000
B    0.166667
C    0.066667
D    0.066667
dtype: float64

Menghapus(drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [40]:
treshold = len(df) *0.9
df = df.dropna(thresh=treshold,axis='columns')
df.head()

            z         A         C         D
0  JYF6Fzc8cp -0.903299 -0.468730  1.448436
1  ghsb1QprnL -0.244421  0.246591  0.011883
2  0DH9VSDHHC -1.204583       NaN -0.065244
3  fg3rvEyyPF -0.085188  0.788887 -1.013376
4  wx2emDfsxN  0.792515 -0.331126  0.160950

#08:Memeriksa kesamaan antar dua buah kolom(Series) pada Data Frme

In [41]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Persiapan Data Frame

In [46]:
data ={'a':[15,15,18,np.nan,12],
       'b' :[15,15,18,np.nan,12]}

df =pd.DataFrame(data)
df

      a     b
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [43]:
df['a']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: a, dtype: float64

In [44]:
type(df['a'])

pandas.core.series.Series

In [45]:
type(df)

pandas.core.frame.DataFrame

Memeriksa Kesamaan dengan operator

In [47]:
df['a'] == df['b']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [49]:
df['a'].equals(df['b'])

True

Memeriksa antar dua Data Frame

In [50]:
df1 = df.copy(deep=True)
df.equals(df1)

True

In [51]:
df == df1

       a      b
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True